pub fn print() {
    println!(
        "Эмулятор учебных машин УМ-1, УМ-2, УМ-3, УМ-С. Более подробно см. https://github.com/xakep71k/machine"
    );
    println!("УМ-3 - трёхадресная учебная машина");
    println!("УМ-2 - двухадресная учебная машина");
    println!("УМ-1 - одноадресная учебная машина");
    println!("УМ-С - безадресная или стековая учебная машина");
    println!("Опции:");
    println!("\t--help\tСправка");
    println!("\t--clist\tСписок команд процессора");
    println!(
        "\t--numeral\tСистема счисления, в которой задаются команды: 2|10|16, по-умолчанию равно 2"
    );
    println!("\t--format\tВозмжные значения: education|binary. Education - это формат где использется форматирование и команды записаны в десятичной системе счисления, формат текстовый. См. пример ниже. Binary - бинарный формат, состоящий из машиных слов длинной 64 бита, тут используется двоичный бинарный формат. Если формат не указывать, то по умолчанию будет использоваться binary.");
    println!("\t--machine-type\tВозможные значения: UM3|УМ3|УМ-3 или UM2|УМ2|УМ-2 или UM1|УМ1|УМ-1 или UMS|УМС|УМ-С");
}
